examples/interFoamHardtPhaseChange/0.orig/alpha.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    movingWall
    {
        //type            inletOutlet;
        //inletValue      $internalField;
        //value           $internalField;
		//type			fixedValue;
		//value			uniform 0;
		type        zeroGradient;
    }

   
    streamwiseIn
    {
        type            cyclic; 
        neighbourPatch  streamwiseOut;
    }

    streamwiseOut
    {
        type            cyclic; 
        neighbourPatch  streamwiseIn;
    }

    CPLReceiveMD 
    {
    	type            fixedValue;
    	value           uniform 0;
    }

    front
    {
        type            cyclic;
        neighbourPatch  back;
    }

    back 
    {
        type            cyclic;
        neighbourPatch  front;
    }

}

// ************************************************************************* //
