examples/interFoamHardtPhaseChange/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    movingWall
    {
        type            totalPressure;
        p0              $internalField;
    }
   
    streamwiseIn
    {
        type            cyclic; 
        neighbourPatch  streamwiseOut;
    }

    streamwiseOut
    {
        type            cyclic; 
        neighbourPatch  streamwiseIn;
    }

    CPLReceiveMD 
    {
        type            zeroGradient;
    }

    front
    {
        type            cyclic;
        neighbourPatch  back;
    }

    back 
    {
        type            cyclic;
        neighbourPatch  front;
    }

}

// ************************************************************************* //
