examples/interFoamHardtPhaseChange/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          480;
        startFace       76140;
    }
    CPLReceiveMD
    {
        type            patch;
        nFaces          480;
        startFace       76620;
    }
    streamwiseIn
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          180;
        startFace       77100;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  streamwiseOut;
    }
    streamwiseOut
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          180;
        startFace       77280;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  streamwiseIn;
    }
    front
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          9600;
        startFace       77460;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  back;
    }
    back
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          9600;
        startFace       87060;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  front;
    }
)

// ************************************************************************* //
