examples/interFoamHardtPhaseChange/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
	location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ALPHA_CRITERION 0;
CONDENSATION 0;

phases          (liquid vapour); // FC-72

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.35;

liquid
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.76;
    rho             rho [ 1 -3 0 0 0 0 0 ] 0.69;

    Cp              Cp [ 0 2 -2 -1 0 0 0] 6.74;
    //Cv              1;   // assume Cp for liquid
    kappa           kappa [1 1 -3 -1 0 0 0] 4.64;
    Hf              Hf [0 2 -2 0 0 0 0] 6.54;
}

vapour
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 3.26;
    //rho             rho [ 1 -3 0 0 0 0 0 ] 0.05;
    rho             0.05;

    Cp              Cp [ 0 2 -2 -1 0 0 0] 4.36;      // FC72 vapour
    //Cv              1;      // Cv = Cp - R/w
    kappa           kappa [1 1 -3 -1 0 0 0] 0.51;       // FC72 vapour
    Hf              Hf [0 2 -2 0 0 0 0] 0.0;
}

PhaseChangeProperties
{
    model           hardtSimple;
    Tsat            Tsat [0 0 0 1 0 0 0] 0.92;
    R               R [0 2 -2 -1 0 0 0] 1.053;
    sigmaEvap       sigmaEvap [0 0 0 0 0 0 0 ] 1.0;
    sigmaCond       sigmaCond [0 0 0 0 0 0 0 ] 1.0;
     DmDot           DmDot [0 2 0 0 0 0 0] 500.0;
}

Prt             0.7;

nu              nu [ 0 2 -1 0 0 0 0 ] 1.76;

// ************************************************************************* //
