examples/interFoamHardtPhaseChange/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
	location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
  //    default             none;
	div(rhoPhi,U)                Gauss limitedLinearV 1;
	div(rhoPhiCp,T)              Gauss limitedLinear 1;
	div(phi,alpha)               Gauss vanLeer;
    div(phirb,alpha)             Gauss interfaceCompression;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(phi,p_rgh)               Gauss linear;

	div(((nu*2)*dev(symm(grad(U))))) Gauss linear;

}

laplacianSchemes
{
    default         Gauss linear orthogonal;
	//default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    //default         corrected;
	default orthogonal;
}

fluxRequired
{
    default         none;
    p_rgh;
    pcorr;
    alpha.liquid;
}


// ************************************************************************* //
