examples/interFoamHardtPhaseChange/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.liquid 1.0
);

regions
(
    boxToCell
    {
        box (0.0 270.0 -5.0) (476.22031559046 476.22031559046 5.0);
        fieldValues
        (
            volScalarFieldValue alpha.liquid 0.0
        );
    }
);


// ************************************************************************* //
