examples/interFoamHardtPhaseChange/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions	 
(	
	{
	name	bulk;
	type 	cellSet;
	action 	new;

	source	boxToCell;
	box	(0 0 0) (500 201.84 10);
	}

	{
	name	bulkZone;
	type	cellZoneSet;
	action	new;

	source setToCellZone;
	set    bulk;
	}
);

